app/controllers/embed/pages_controller.rb

  def display
    gon.videos_urls = []
    gon.image_urls = []
    @teename = []
    @course = Course.find(params[:id])
    @course_status = @course.resort.hide_carousel
    @resort = @course.resort
    resolution = (is_mobile? ? 'mobile' : 'medium').to_sym
    @course.playlist_items.each do |video|
      gon.videos_urls << video.video.url(resolution).gsub('s3-us-west-2.amazonaws.com/fore92', 'd1s5na5d5z3eyp.cloudfront.net').gsub("http", "https") if video.video.present?
      gon.image_urls << video.thumbnail_image.url.gsub('s3-us-west-2.amazonaws.com/fore92', 'd1s5na5d5z3eyp.cloudfront.net').gsub("http", "https") if video.thumbnail_image.present?
    end
    @videos_urls = gon.videos_urls
    @holes = @course.holes.order("hole_num")
    @score_cards = @course.sorted_scorecards
    @course.score_cards.each do |scorecard|
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "resorts".* FROM "resorts" WHERE "resorts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."resort_id" = $1  [["resort_id", 1]]
SELECT "holes".* FROM "holes" WHERE "holes"."course_id" = $1 ORDER BY hole_num  [["course_id", 7]]
SELECT "score_cards".* FROM "score_cards" WHERE "score_cards"."course_id" = $1  [["course_id", 7]]

  def hole_by_hole
    @hide_carousal = true
    gon.hole_num = []
    gon.videos = []
    gon.videos_urls = []
    gon.tags = []
    gon.par = []
    gon.yard = []
    gon.mhcp = []
    gon.image = []
    gon.image_urls = []
    gon.description = []
    @hole = Hole.find(params[:id])
    @course = Course.find(@hole.course_id)
    @course_color = Course.find(@hole.course_id).color_selector
    @holes = @course.holes.sort_by{ |m| m.hole_num }
    resolution = (is_mobile? ? 'mobile' : 'medium').to_sym
    @holes.each do |hole|
      gon.hole_num << hole.hole_num if hole.video.present?
---
SELECT  "holes".* FROM "holes" WHERE "holes"."id" = $1 LIMIT $2  [["id", 109], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "holes".* FROM "holes" WHERE "holes"."course_id" = $1  [["course_id", 7]]
SELECT "pars".* FROM "pars" WHERE "pars"."hole_id" = $1  [["hole_id", 109]]
SELECT "tags".* FROM "tags" WHERE "tags"."video_id" = $1  [["video_id", 129]]