app/views/embed/pages/_course_information.html.erb

<ul id="slider" class="bxslider">
  <% @course.course_images.each do | courseimage | %>
---
SELECT "course_images".* FROM "course_images" WHERE "course_images"."course_id" = $1  [["course_id", 7]]