app/views/embed/pages/_course_home_video_container.html.erb

            </li>
            <% @course.resort.courses.each do |course| %>
---
SELECT  "resorts".* FROM "resorts" WHERE "resorts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."resort_id" = $1  [["resort_id", 1]]

            <% @holes.try(:each) do |hole| %>
              <li id="<%=hole.hole_num%>" class= "hole-number" hole_image= "<%= hole.logo_image.present? ? hole.logo_image.url : logo_on_video(@course)%>" logo_hyperlink = "<%= hole.logo_hyperlink.present? ? hole.logo_hyperlink : hyperlink_on_video(@course)%>" color="<%=color_selector(@course.color_selector)%>">
---
SELECT "holes".* FROM "holes" WHERE "holes"."course_id" = $1 ORDER BY hole_num  [["course_id", 7]]